<template>
    <div class="flex w-full h-full text-white items-center justify-center">
        <div class="flex w-fit h-full items-center justify-end">
            <img class="w-auto h-auto" :src="getImageURL('images/cartoons/gear-point.png')" alt="">
        </div>
        <div
            class="relative flex flex-col items-center justify-start lg:w-[1260px] lg:h-[768px] bg-[#C4C5C54D] rounded-nw shadow-[#FFC233] shadow-md">
            <div class="text-[36px] font-medium text-[#FFC233] py-9">
                ความยินยอมการใช้งานระบบ
            </div>
            <div
                class="w-full h-[485px] flex justify-center items-center rounded-nw bg-white overflow-y-auto text-black">
                <div class="flex flex-col max-w-[860px] h-full py-6 text-justify">
                    นโยบายคุ้มครองข้อมูลส่วนบุคคล (PDPA) สำหรับนักเรียน <br />
                    <br />
                    โครงการค่ายเฟืองเชิงสะเต็มแบบห้องเรียนพลิกกลับที่ปรับให้เหมาะสมรายบุคคล <br />
                    เพื่อพัฒนาความเข้าใจ การกำกับการเรียนรู้ด้วยตนเอง ทักษะการรู้คิด <br />
                    และการมีส่วนร่วมของนักเรียนมัธยมศึกษา <br />
                    (ต่อไปนี้เรียกว่า “โครงการ”) <br />
                    โครงการเคารพสิทธิความเป็นส่วนตัวของนักเรียน ผู้ปกครอง และผู้ใช้งานเว็บไซต์ทุกท่าน <br />
                    และมุ่งมั่นในการคุ้มครองข้อมูลส่วนบุคคลให้เป็นไปตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
                    (“PDPA”) <br />
                    นโยบายฉบับนี้อธิบายว่าข้อมูลใดที่เราเก็บรวบรวม ใช้ และเปิดเผยอย่างไร <br />
                    รวมถึงสิทธิของเจ้าของข้อมูลส่วนบุคคล <br />
                    เพื่อให้นักเรียนเข้าใจง่าย ๆ ว่าเว็บนี้เก็บข้อมูลอะไร และใช้ไปทำอะไรบ้าง โปรดอ่านให้จบก่อนกด
                    “ยอมรับ” <br />
                    ข้อมูลส่วนบุคคลที่โครงการเก็บรวบรวม
                    เว็บโครงการจะขอเก็บข้อมูลส่วนตัวของนักเรียน เช่น <br />

                    ข้อมูลระบุตัวตนพื้นฐาน ได้แก่ <br />
                    <ul class="list-disc list-inside ml-5">
                        <li>ชื่อ-นามสกุล</li>
                        <li>ระดับชั้น</li>
                        <li>โรงเรียน</li>
                        <li>อายุ</li>
                        <li>เพศ</li>
                    </ul>

                    ข้อมูลการเรียนในค่าย เช่น คะแนนแบบทดสอบ เวลาเข้าใช้งานเว็บ คำตอบกิจกรรมต่าง ๆ ฯลฯ <br />

                    <br />
                    2. วัตถุประสงค์ในการเก็บรวบรวมและใช้ข้อมูลส่วนบุคคล <br />
                    ข้อมูลของนักเรียนจะถูกใช้เพื่อ
                    ลงทะเบียนและยืนยันตัวตนสำหรับเข้าใช้งานเว็บไซต์และเข้าร่วม <br />
                    โครงการค่ายเฟืองเชิงสะเต็มแบบห้องเรียนพลิกกลับที่ปรับให้เหมาะสมรายบุคคล <br />

                    จัดแผนการเรียนและกิจกรรมให้เหมาะกับแต่ละคน (personalized learning) <br />

                    ติดตามความเข้าใจ การกำกับการเรียนรู้ด้วยตนเอง ทักษะการคิด และการมีส่วนร่วมของนักเรียน <br />


                    ใช้ในการสรุปผล/ประเมินผลโครงการ หรือทำวิจัยเชิงการศึกษา โดยรายงานผลในภาพรวม ไม่ระบุตัวตนรายบุคคล
                    <br />


                    ติดต่อแจ้งข่าวสารที่เกี่ยวข้องกับโครงการ (เช่น แจ้งกำหนดการ หรือผลการประเมิน) <br />

                    <br />
                    3. การเปิดเผยและการโอนข้อมูลส่วนบุคคล <br />
                    ทีมวิจัยและผู้รับผิดชอบโครงการ <br />


                    ครูหรือโรงเรียนของนักเรียน ในส่วนที่จำเป็นต่อการดูแลและติดตามผลการเรียน <br />


                    หน่วยงานที่เกี่ยวข้องกับโครงการ เช่น สถาบันการศึกษา/แหล่งทุน แต่จะเห็นในลักษณะข้อมูลสรุปรวม
                    ไม่ระบุตัวตน <br />
                    เราจะไม่ขาย/เผยแพร่ข้อมูลของนักเรียนเพื่อการโฆษณาหรือเชิงพาณิชย์เด็ดขาด <br />
                    <br />
                    4. ระยะเวลาในการเก็บรักษาข้อมูลส่วนบุคคล <br />
                    ข้อมูลจะถูกเก็บไว้ตลอดระยะเวลาที่ดำเนินโครงการ และหลังจบโครงการไม่เกิน [เช่น 5 ปี]
                    หลังจากนั้นข้อมูลที่ระบุตัวตนได้จะถูกลบ หรือเก็บในรูปแบบที่ไม่สามารถระบุตัวบุคคลได้ <br />
                    <br />
                    5. สิทธิของนักเรียนและผู้ปกครอง <br />
                    นักเรียน (และผู้ปกครอง) มีสิทธิที่จะ
                    ขอทราบว่าระบบเก็บข้อมูลอะไรของเราไว้บ้าง <br />

                    ขอให้แก้ไขข้อมูลหากไม่ถูกต้องหรือไม่ครบถ้วน <br />

                    ขอให้ลบ หรือระงับการใช้ข้อมูลในบางกรณี <br />

                    ถอนความยินยอม (แต่การถอนยินยอมอาจทำให้ไม่สามารถใช้ระบบ/เข้าร่วมบางกิจกรรมได้เต็มที่) <br />
                    หากต้องการใช้สิทธิ สามารถติดต่อที่ <br />
                    อีเมล: [example@email.com] <br />
                    ผู้รับผิดชอบโครงการ: [ชื่อผู้ประสานงาน/ทีมวิจัย] <br />
                    <br />
                    6. การให้ความยินยอมผ่านเว็บไซต์ <br />
                    เมื่อคุณกด “ยอมรับ” หมายถึงว่า <br />
                    คุณได้อ่านและเข้าใจสิ่งที่เว็บนี้เก็บและใช้ข้อมูลของคุณแล้ว <br />

                    <br />
                    คุณยินยอมให้โครงการเก็บ ใช้ และประมวลผลข้อมูลส่วนบุคคลของคุณตามที่อธิบายไว้ข้างต้น <br />

                    หากคุณเป็นผู้เยาว์ ระบบ/โรงเรียนอาจมีการขอความยินยอมจากผู้ปกครองเพิ่มเติมด้วย <br />
                </div>
            </div>

            <div class="mt-6 w-fit h-fit flex flex-col justify-center items-center">
                <div class="flex items-center justify-center mb-6 gap-2">
                    <input id="link-checkbox" type="checkbox" value="" class="w-8 h-8 accent-[#FFC233] rounded-lg"
                        v-model="accepted" />
                    <label for="link-checkbox" class="select-none ms-2 text-sm font-medium text-heading">
                        ข้าพเจ้าได้อ่านและทำความเข้าใจ "ประกาศความเป็นส่วนตัวสำหรับการเก็บข้อมูลเพื่อการวิจัย"
                        แล้ว และยินยอม ให้ [ระบุชื่อหน่วยงาน/โครงการ]  <br />
                        เก็บ รวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคลของข้าพเจ้า
                        (ตามที่ระบุข้างต้น) เพื่อวัตถุประสงค์ในการพัฒนางานวิจัยและวิเคราะห์ทางสถิติเท่านั้น </label>
                </div>

            </div>
            <button @click="accept" class="absolute -bottom-7 flex w-[200px] h-[60px] text-[26px] font-medium bg-[#FFC233] text-black hover:bg-[#B97530] hover:text-white drop-shadow-xl font-medium
            rounded-[15px] items-center justify-center cursor-pointer">
                ยอมรับ ไปต่อ
            </button>
        </div>
    </div>
</template>

<script setup lang="ts">
definePageMeta({ middleware: ['auth'] })

import { useAuth } from '~/composables/useAuth'
const { user, refreshMe } = useAuth()
const { getImageURL } = useAssetUrl()

const accepted = ref(false)

const config = useRuntimeConfig()

const accept = async () => {
    // await $fetch(`${config.public.apiBase}/users/pdpa-accept`, {
    //     method: 'POST',
    //     credentials: 'include'
    // })
    return navigateTo('/notice', { replace: true })
}
</script>